# циклы: while, for
# break, continue
# i - item, itareble

"""
1) Написать программу, которая продолжает запрашивать у пользователя число,
пока он не введет 0

2) Написать программу, которая считает количество введенных пользователем чисел,
 пока он не введет отрицательное число
"""""


# while условие:
#    блок кода

"""c = 0

while c < 100:
    c += 1
    if c == 40:
        continue
    print("hello", c)"""





